curl/request.txt

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<ns4:acceptCallCardRequest xmlns:ns4="http://www.glonass.ru/era/esg">
			<ns4:callCard cardId="89F37C6C05BF0EE2E05305C84D0A9FF9" cardShortId="67316" terminalPhone="9419154791" declarantLanguageCode="ru-RU" voiceChannelState="unknown" injuredPersons="-1" driverFullName="">
				<ns4:automaticActivation>true</ns4:automaticActivation>
				<ns4:testCall>false</ns4:testCall>
				<ns4:vehicleType>1</ns4:vehicleType>
				<ns4:vehicleIdentificationNumber>WDF44781513284266</ns4:vehicleIdentificationNumber>
				<ns4:vehiclePropulsionStorageType>2</ns4:vehiclePropulsionStorageType>
				<ns4:vehicleRegistryNumber>Х503ЕМ777</ns4:vehicleRegistryNumber>
				<ns4:vehicleBodyColor>ЧЕРНЫЙ</ns4:vehicleBodyColor>
				<ns4:vehicleModel>Mercedes-Benz V-Class</ns4:vehicleModel>
				<ns4:callTimestamp>2018-01-24T08:55:28.000+03:00</ns4:callTimestamp>
				<ns4:vehicleLocation latitude="201721414" longitude="129477337" positionCanBeTrusted="true" timestamp="2018-01-24T08:54:28.000+03:00"/>
				<ns4:vehicleDirection>44</ns4:vehicleDirection>
				<ns4:recentVehicleLocation latitude="200957263" longitude="134533929" positionCanBeTrusted="true" timestamp="2018-01-24T08:54:28.000+03:00"/>
				<ns4:recentVehicleLocation latitude="200957263" longitude="134533929" positionCanBeTrusted="true" timestamp="2018-01-24T08:54:28.000+03:00"/>
				<ns4:numberOfPassengers>2</ns4:numberOfPassengers>
				<ns4:vehicleLocationDescription>15а</ns4:vehicleLocationDescription>
			</ns4:callCard>
		</ns4:acceptCallCardRequest>
	</soapenv:Body>
</soapenv:Envelope>